artillery.yml
config:
  target: 'http://localhost:4000/'
  phases:
    - duration: 300
      arrivalRate: 10
      maxVusers: 50
before:
  flow:
    - log: 'Get JWT'
    - post:
      url: '/users'
      json:
        login: 'admin'
        password: 'admin'
      capture:
        - json: $.token
          as: token
scenarios:
    flow:
      - get:
        url: '/users'
        headers: 
          authorization: "Bearer {{ token }}"